[
    {
        "id": 1,
        "title": "The easiest way to stop negotiating on placement fees",
        "date": "Apr 6",
        "img": "./hosted-images/article1.jpg",
        "read": "2 minutes to read",
        "content": "When you have an important permanent role to fill, partnering with contingent search recruiters is a smart approach. You’re probably looking forward to getting some outside expertise, being introduced to top candidates, and filling your position faster. One thing you’re probably not looking forward to, though? Negotiating a placement fee with recruiters.\n\n        Working with direct hire search firms and staffing agencies typically means either accepting their fees—or more likely, going back and forth to negotiate the fee that is acceptable to everyone. Some agencies are more flexible on the fee than others, so your results in negotiating will vary. \n        \n        Looking to work with multiple recruiters to increase your chances of filling the role quickly? The competition element will expand your candidate reach while keeping recruiters on their toes and accelerating your search. But using multiple recruiters also means multiple fee negotiations, and this ultimately prolongs the time before your search even begins.\n        \n        So how can you, the employer, be in control of the placement fee without going back and forth with multiple agencies? We’ve got just the solution with Skill.com.\n        \n        Rather than recruiters naming their price, you are in control of the placement fee you pay. You determine the fee that’s in your budget, no negotiating necessary. You’ll pay the placement fee when you make a hire, regardless of which recruiter in our network submitted the winning candidate. While the median placement fee for direct hire recruiting is 20% (according to Staffing Industry Analysts), we let employers choose a fee between 10% and 30%. We’re so confident that you’ll be satisfied, every hire is backed by a 90-day money-back guarantee.\n\n        We’ve found that allowing employers to set their own fees has helped them save significantly on their search firm costs. In the end, setting the right fee is all about finding that balance between managing your costs and making it attractive to great recruiters—so they’re engaged in your search.\n\n        Working with recruiting partners can be a big investment, but it’s worth it because of all the value they bring to the hiring process. Our highly skilled specialty recruiters bring deep market knowledge of your industry. They expand your reach to a diverse candidate pool across the country, giving you access to top candidates working at other companies who are also open to new opportunities. And they know how to vet candidates, so you don’t have to. We know that a little healthy competition between recruiters leads to better results, so we built Skill.com to make it quick and easy to engage multiple highly rated recruiters in your search. \n\n        Want to save more money on your first job post? Join our Beta Program and get access to thousands of recruiters and a promo code to save $299 on your first job post."
    },
    {
        "id": 2,
        "title": "The key to hiring via video—be prepared",
        "date": "Mar 29",
        "img": "./hosted-images/article2.png",
        "read": "3 minutes to read",
        "content": "Over the last year, we have all had to start doing things differently.  From elbow-bumping instead of handshakes to working from your living room rather than the office, we have all adapted. That includes how we hire. \n\n        Interviews are a normal part of the hiring process, but in-person interviews are less frequent these days, and video interviews have become the norm. It seems simple, but shifting to live video interviews comes with its own set of challenges, from technology to decor. \n        \n        Know what tech it takes. \n        There are a multitude of video chat technologies out there. Your organization may have a preferred one that you use, like Microsoft Teams or Google Hangouts. When you are setting up a video interview, don’t forget that the candidate may not have ready access to the same tools. Do they need to set up an account? Download an application? If so, let the candidate know in advance.\n        \n        Use a tool that is easy for individuals to access and use. Take the time to test it on your end and encourage the candidate to do the same.\n        \n        Set expectations. \n        Setting expectations does not only apply to having the right technology. It also applies to what happens once you are on the call. For example, if you want to record the call so you can refer back to it, make sure you get the proper consent from the candidate. \n        \n        Another part of setting expectations means keeping candidates informed. That means being transparent about your hiring process (which could be different these days) and future plans regarding returning to the office. \n        \n        Carole Neal, Head of Marketing for Skill.com and Vitamin Talent, commented that normally new candidates should be interviewed for about 30 minutes for an intro interview and 45 minutes for a follow up interview before any decisions are made. Carole’s advice to employers, “Let candidates know in advance to set aside at least an hour or more for the interview.”\n        \n        Be consistent and prepared. \n        It’s easy to fall into a conversation with a candidate. However, it’s important to keep the topics and questions you cover consistent. This is not only a compliance issue (making sure you treat all candidates fairly), but it also helps you objectively compare how each candidate stacks up. \n        \n        The simplest way to be prepared is to be on time. Candidates will show up early (on average, about 10 minutes prior to the call time), and interviewers tend to show up late (about 7 minutes behind schedule). Set an alert so that you can show up and start the interview on time.\n        \n        It’s business, and it’s personal. \n        Since we are all adapting to working at home, our homes have become our offices. That means that kids, pets, doorbells, and more will become a part of a call, no matter how much you prepare. Be empathetic and understand that during your call, you are literally being invited into someone’s home and life. That’s bringing the personal and business spaces into one. \n        \n        On the topic of being invited into someone’s home, make sure your background reflects you or how you want to be perceived by a prospective employee. No need to buy a green screen and get fancy—just make sure there’s no pile of dirty dishes or a hamper full of laundry behind you. \n        \n        Don’t forget the candidate experience. \n        Interviews are not just about you testing a candidate’s expertise and skills. You are also being tested by the candidate. It is as much about you selling the opportunity and your organization as it is about the candidate selling themselves. That doesn’t change when you are conducting video interviews. Make sure to turn off any distractions (e.g., put the dog in the other room, turn off chat).\n        \n        Even as office spaces start to reopen and we can safely return to in-person interviews, video interviews are most likely here to stay. Not only are companies adopting hybrid working options, but remote work has opened up hiring options. Your talent pool now spans the entire country,  and the right candidate might be three states over. Whether they’re the first step to get to know candidates or the only way you interview, video interviews are part of the process, and knowing how to do them right is one more way to make your organization stand out. Now that you’ve learned the ins and outs of video hiring, check out this link to save $299 on your first job post."
    },
    {
        "id": 3,
        "title": "Advice on working with a recruiter from a recruiter",
        "author": "Christy Rows, Yohana",
        "date": "Apr 6",
        "img": "./hosted-images/article3.jpg",
        "read": "3 minutes to read",
        "content": "So, you have a super important role to fill and you’ve decided to get help from independent recruiters. That’s a great move. You’ll save time and get more qualified candidates than if you were to try to do everything yourself. But there are some things you can do to make sure you’re getting the most out of your experience.\n\n        We recently chatted with Christy Rowe from Yochana, an award-winning staffing and recruitment firm in Farmington Hills, Michigan. Christy is one of the top recruiters in our network, and we asked her if she had any advice for employers when they work with a recruiter. Here are some nuggets of wisdom that she was kind enough to share:\n        \n        Give the nitty-gritty details.\n        The more information you give the recruiters, the more likely they are to find you the perfect candidate. It starts with details. If a certain skill is mandatory, make sure to specify that. Don’t say it’s optional. The same goes for feedback. It’s critical that you explain why you might be passing on a submitted candidate. “Not a good fit,” isn’t going to be enough. Your thorough feedback helps the recruiter know why someone was a miss and sets everyone up for success with subsequent candidates\n        \n        Time is of the essence.\n        The best candidates aren’t available for long. If you think someone is great, chances are someone else does too. If you feel a candidate is a good fit for your organization, it’s important to move quickly. A good recruiter knows that. They know how to efficiently get that candidate to a “yes,” and how to quickly get them started.\n        \n        Communication is key.\n        Don’t skimp on the details. That means letting the recruiters understand the full story. Why is there an open position? Did the last person not work out? Why? What should the next person have that will help them succeed? Are you open to candidates who will work remotely? Why or why not? The more detail the better. It helps refine the search and—in the long run—saves everyone time and effort. \n        \n        Think of recruiters as partners.\n        It’s a myth that recruiters just want to try to sell you the first candidate they send you. It’s simply not true. If you hire a candidate that is submitted by a recruiter and that candidate doesn’t work out, chances are you may never use that recruiter again. Not a great long-term success strategy for that recruiter. Good recruiters understand the long game. They know that your long-term success is their long-term success.    \n        \n        If you work with recruiters collaboratively, invest the time to thoroughly communicate what you’re looking for and follow up with timely feedback on candidates submitted for your review. Do that and you are far more likely to hit a home run. \n        \n        When you’re ready to find your next great hire, we have more than 60,000 specialty recruiters (in virtually every industry and skillset) ready to partner with you. Check out this link to save $299 on your first job post."
    }
]